Samsung/TizenRT/os/board/rtl8720e/src/component/wifi/driver/include/hal_com_reg.h
/******************************************************************************
 *
 * Copyright(c) 2007 - 2011 Realtek Corporation. All rights reserved.
 *
 * This program is free software; you can redistribute it and/or modify it
 * under the terms of version 2 of the GNU General Public License as
 * published by the Free Software Foundation.
 *
 * This program is distributed in the hope that it will be useful, but WITHOUT
 * ANY WARRANTY; without even the implied warranty of MERCHANTABILITY or
 * FITNESS FOR A PARTICULAR PURPOSE. See the GNU General Public License for
 * more details.
 *
 * You should have received a copy of the GNU General Public License along with
 * this program; if not, write to the Free Software Foundation, Inc.,
 * 51 Franklin Street, Fifth Floor, Boston, MA 02110, USA
 *
 *
 ******************************************************************************/
#ifndef __HAL_COMMON_REG_H__
#define __HAL_COMMON_REG_H__


#define MAC_ADDR_LEN				6

#define HAL_NAV_UPPER_UNIT		128		// micro-second

// 8188E PKT_BUFF_ACCESS_CTRL value
#define TXPKT_BUF_SELECT				0x69
#define RXPKT_BUF_SELECT				0xA5
#define DISABLE_TRXPKT_BUF_ACCESS		0x0

//============================================================
//
//============================================================

//-----------------------------------------------------
//
//	0x0000h ~ 0x00FFh	System Configuration
//
//-----------------------------------------------------
#define REG_SYS_ISO_CTRL				0x0000
#define REG_SYS_FUNC_EN				0x0002
#define REG_APS_FSMCO					0x0004
#define REG_SYS_CLKR					0x0008
#define REG_9346CR						0x000A
#define REG_SYS_EEPROM_CTRL			0x000A
#define REG_EE_VPD						0x000C
#define REG_AFE_MISC					0x0010
#define REG_SPS0_CTRL					0x0011
#define REG_SPS0_CTRL_6					0x0016
#define REG_POWER_OFF_IN_PROCESS 		0x0017
#define REG_SPS_OCP_CFG				0x0018
#define REG_RSV_CTRL					0x001C
#define REG_RF_CTRL						0x001F
#define REG_LDOA15_CTRL				0x0020
#define REG_LDOV12D_CTRL				0x0021
#define REG_LDOHCI12_CTRL				0x0022
#define REG_LPLDO_CTRL					0x0023
#define REG_AFE_XTAL_CTRL				0x0024
#define REG_AFE_LDO_CTRL				0x0027 // 1.5v for 8188EE test chip, 1.4v for MP chip
#define REG_AFE_PLL_CTRL				0x0028
#define REG_MAC_PHY_CTRL				0x002c //for 92d, DMDP,SMSP,DMSP contrl
#define REG_APE_PLL_CTRL_EXT			0x002c
#define REG_EFUSE_CTRL					0x0030
#define REG_EFUSE_TEST					0x0034
#define REG_PWR_DATA					0x0038
#define REG_CAL_TIMER					0x003C
#define REG_ACLK_MON					0x003E
#define REG_GPIO_MUXCFG				0x0040
#define REG_GPIO_IO_SEL					0x0042
#define REG_MAC_PINMUX_CFG			0x0043
#define REG_GPIO_PIN_CTRL				0x0044
#define REG_GPIO_INTM					0x0048
#define REG_LEDCFG0						0x004C
#define REG_LEDCFG1						0x004D
#define REG_LEDCFG2						0x004E
#define REG_LEDCFG3						0x004F
#define REG_FSIMR						0x0050
#define REG_FSISR						0x0054
#define REG_HSIMR						0x0058
#define REG_HSISR						0x005c
#define REG_GPIO_PIN_CTRL_2			0x0060 // RTL8723 WIFI/BT/GPS Multi-Function GPIO Pin Control.
#define REG_GPIO_IO_SEL_2				0x0062 // RTL8723 WIFI/BT/GPS Multi-Function GPIO Select.
#define REG_MULTI_FUNC_CTRL			0x0068 // RTL8723 WIFI/BT/GPS Multi-Function control source.
#define REG_GSSR						0x006c
#define REG_WL_BTCOEX_CTRL			0x0074
#define REG_AFE_XTAL_CTRL_EXT			0x0078 //RTL8188E
#define REG_XCK_OUT_CTRL				0x007c //RTL8188E
#define REG_MCUFWDL					0x0080
#define REG_WOL_EVENT					0x0081 //RTL8188E
#define REG_MCUTSTCFG					0x0084
#define REG_FDHM0						0x0088
#define REG_HOST_SUSP_CNT				0x00BC	// RTL8192C Host suspend counter on FPGA platform
#define REG_SYSTEM_ON_CTRL			0x00CC	// For 8723AE Reset after S3
#define REG_EFUSE_ACCESS				0x00CF	// Efuse access protection for RTL8723
#define REG_BIST_SCAN					0x00D0
#define REG_BIST_RPT					0x00D4
#define REG_BIST_ROM_RPT				0x00D8
#define REG_USB_SIE_INTF				0x00E0
#define REG_PCIE_MIO_INTF				0x00E4
#define REG_PCIE_MIO_INTD				0x00E8
#define REG_HPON_FSM					0x00EC
#define REG_SYS_CFG						0x00F0
#define REG_GPIO_OUTSTS				0x00F4	// For RTL8723 only.
#define REG_TYPE_ID						0x00FC


#define REG_WL_CLK_CTRL                 		0x0002
#define REG_WL_FUNC_EN                  		0x0004
#define REG_WL_PMC_CTRL                 		0x0020
#define REG_WL_AFE_CTRL    				0x0050
#define REG_WL_PMC_IMR                  		0x0080
#define REG_WL_PMC_ISR                  		0x0084

#define REG_AFC_CTRL_8721D                  	0x0030
#define REG_HIMR0_8721D                  		0x00B0
#define REG_HISR0_8721D                  		0x00B4

//-----------------------------------------------------
//
//	0x0100h ~ 0x01FFh	MACTOP General Configuration
//
//-----------------------------------------------------
#define REG_CR							0x0100
#define REG_PBP							0x0104
#define REG_PKT_BUFF_ACCESS_CTRL		0x0106
#define REG_TRXDMA_CTRL				0x010C
#define REG_TRXFF_BNDY					0x0114
#define REG_TRXFF_STATUS				0x0118
#define REG_RXFF_PTR					0x011C
#define REG_HIMR						0x0120
#define REG_HISR						0x0124
#define REG_HIMRE						0x0128
#define REG_HISRE						0x012C
#define REG_CPWM						0x012F
#define REG_FWIMR						0x0130
#define REG_FWISR						0x0134
#define REG_FTIMR						0x0138
#define REG_FTISR						0x013C //RTL8192C
#define REG_PKTBUF_DBG_CTRL			0x0140
#define REG_RXPKTBUF_CTRL				(REG_PKTBUF_DBG_CTRL+2)
#define REG_PKTBUF_DBG_DATA_L			0x0144
#define REG_PKTBUF_DBG_DATA_H		0x0148

#define REG_TC0_CTRL					0x0150
#define REG_TC1_CTRL					0x0154
#define REG_TC2_CTRL					0x0158
#define REG_TC3_CTRL					0x015C
#define REG_TC4_CTRL					0x0160
#define REG_TCUNIT_BASE				0x0164
#define REG_MBIST_START				0x0174
#define REG_MBIST_DONE					0x0178
#define REG_MBIST_FAIL					0x017C
#define REG_32K_CTRL					0x0194 //RTL8188E
#define REG_C2HEVT_MSG_NORMAL		0x01A0
#define REG_C2HEVT_CLEAR				0x01AF
#define REG_MCUTST_1					0x01c0
#define REG_MCUTST_WOWLAN			0x01C7	// Defined after 8188E series.
#define REG_FMETHR						0x01C8
#define REG_HMETFR						0x01CC
#define REG_HMEBOX_0					0x01D0
#define REG_HMEBOX_1					0x01D4
#define REG_HMEBOX_2					0x01D8
#define REG_HMEBOX_3					0x01DC
#define REG_LLT_INIT					0x01E0

//-----------------------------------------------------
//
//	0x0200h ~ 0x027Fh	TXDMA Configuration
//
//-----------------------------------------------------
#define REG_RQPN						0x0200
#define REG_FIFOPAGE					0x0204
#define REG_TDECTRL						0x0208
#define REG_TXDMA_OFFSET_CHK			0x020C
#define REG_TXDMA_STATUS				0x0210
#define REG_RQPN_NPQ					0x0214
#define REG_AUTO_LLT					0x0224


//-----------------------------------------------------
//
//	0x0280h ~ 0x02FFh	RXDMA Configuration
//
//-----------------------------------------------------
#define REG_RXDMA_AGG_PG_TH			0x0280
#define REG_RXPKT_NUM					0x0284
#define REG_RXDMA_STATUS				0x0288
#define REG_RXDMA_MODE					0x0290
#define REG_C2H_PKT_8723B				0x0294


//-----------------------------------------------------
//
//	0x0300h ~ 0x03FFh	PCIe
//
//-----------------------------------------------------
#define REG_PCIE_CTRL_REG				0x0300
#define REG_INT_MIG						0x0304	// Interrupt Migration 
#define REG_BCNQ_DESA					0x0308	// TX Beacon Descriptor Address
#define REG_HQ_DESA					0x0310	// TX High Queue Descriptor Address
#define REG_MGQ_DESA					0x0318	// TX Manage Queue Descriptor Address
#define REG_VOQ_DESA					0x0320	// TX VO Queue Descriptor Address
#define REG_VIQ_DESA					0x0328	// TX VI Queue Descriptor Address
#define REG_BEQ_DESA					0x0330	// TX BE Queue Descriptor Address
#define REG_BKQ_DESA					0x0338	// TX BK Queue Descriptor Address
#define REG_RX_DESA						0x0340	// RX Queue	Descriptor Address
//sherry added for DBI Read/Write  20091126
#define REG_DBI_WDATA					0x0348	// Backdoor REG for Access Configuration
#define REG_DBI_RDATA                         	0x034C	//Backdoor REG for Access Configuration
#define REG_DBI_CTRL                      		0x0350	//Backdoor REG for Access Configuration
#define REG_DBI_FLAG                      		0x0352	//Backdoor REG for Access Configuration
#define REG_MDIO						0x0354	// MDIO for Access PCIE PHY
#define REG_DBG_SEL						0x0360	// Debug Selection Register
#define REG_PCIE_HRPWM					0x0361	//PCIe RPWM
#define REG_PCIE_HCPWM					0x0363	//PCIe CPWM
#define REG_WATCH_DOG					0x0368

// For new buffer descriptor ring architecture

#define REG_LX_CTRL1                			0x0300  // 4 Bytes

#define REG_BCNQ_TXBD_DESA          		0x0308  // 8 Bytes
#define REG_MGQ_TXBD_DESA           		0x0310  // 8 Bytes 
#define REG_VOQ_TXBD_DESA          		0x0318  // 8 Bytes
#define REG_VIQ_TXBD_DESA           		0x0320  // 8 Bytes
#define REG_BEQ_TXBD_DESA           		0x0328  // 8 Bytes
#define REG_BKQ_TXBD_DESA           		0x0330  // 8 Bytes
#define REG_RXQ_RXBD_DESA           		0x0338  // 8 Bytes
#define REG_HI0Q_TXBD_DESA          		0x0340  // 8 Bytes
#define REG_HI1Q_TXBD_DESA          		0x0348  // 8 Bytes
#define REG_HI2Q_TXBD_DESA          		0x0350  // 8 Bytes
#define REG_HI3Q_TXBD_DESA          		0x0358  // 8 Bytes
#define REG_HI4Q_TXBD_DESA          		0x0360  // 8 Bytes
#define REG_HI5Q_TXBD_DESA          		0x0368  // 8 Bytes
#define REG_HI6Q_TXBD_DESA         		0x0370  // 8 Bytes
#define REG_HI7Q_TXBD_DESA          		0x0378  // 8 Bytes

#define REG_MGQ_TXBD_NUM            		0x0380  // 2 Bytes
#define REG_RX_RXBD_NUM             		0x0382  // 2 Bytes
#define REG_VOQ_TXBD_NUM            		0x0384  // 2 Bytes
#define REG_VIQ_TXBD_NUM            		0x0386  // 2 Bytes
#define REG_BEQ_TXBD_NUM            		0x0388  // 2 Bytes
#define REG_BKQ_TXBD_NUM            		0x038A  // 2 Bytes
#define REG_HI0Q_TXBD_NUM           		0x038C  // 2 Bytes
#define REG_HI1Q_TXBD_NUM           		0x038E  // 2 Bytes
#define REG_HI2Q_TXBD_NUM           		0x0390  // 2 Bytes
#define REG_HI3Q_TXBD_NUM           		0x0392  // 2 Bytes
#define REG_HI4Q_TXBD_NUM           		0x0394  // 2 Bytes
#define REG_HI5Q_TXBD_NUM           		0x0396  // 2 Bytes
#define REG_HI6Q_TXBD_NUM           		0x0398  // 2 Bytes
#define REG_HI7Q_TXBD_NUM           		0x039A  // 2 Bytes

#define REG_BD_RWPTR_CLR            		0x039C  // 4 Bytes
#define REG_VOQ_TXBD_IDX            		0x03A0  // 4 Bytes
#define REG_VIQ_TXBD_IDX            		0x03A4  // 4 Bytes
#define REG_BEQ_TXBD_IDX            		0x03A8  // 4 Bytes
#define REG_BKQ_TXBD_IDX            		0x03AC  // 4 Bytes
#define REG_MGQ_TXBD_IDX            		0x03B0  // 4 Bytes
#define REG_RXQ_RXBD_IDX            		0x03B4  // 4 Bytes
#define REG_HI0Q_TXBD_IDX           		0x03B8  // 4 Bytes
#define REG_HI1Q_TXBD_IDX           		0x03BC  // 4 Bytes
#define REG_HI2Q_TXBD_IDX           		0x03C0  // 4 Bytes
#define REG_HI3Q_TXBD_IDX           		0x03C4  // 4 Bytes
#define REG_HI4Q_TXBD_IDX           		0x03C8  // 4 Bytes
#define REG_HI5Q_TXBD_IDX           		0x03CC  // 4 Bytes
#define REG_HI6Q_TXBD_IDX           		0x03D0  // 4 Bytes
#define REG_HI7Q_TXBD_IDX           		0x03D4  // 4 Bytes

//CPWM &RPWM
#define REG_LX_HRPWM_8711B			0x03D9  // 1 Bytes
#define REG_LX_HCPWM_8711B			0x03DA  // 1 Bytes //from 0x14c

#define REG_LX_CTRL2                			0x03DB  // 1 Bytes

#define REG_LX_HRPWM2_8711B          		0x03DC  // 2 Bytes //REG_LX_HCPWM1_8711B
#define REG_LX_HCPWM2_8711B          		0x03DE  // 2 Bytes 
#define REG_LX_H2C_MSG_V1         		0x03E0  // 4 Bytes
#define REG_LX_C2H_MSG_V1         		0x03E4  // 4 Bytes


