Samsung/TizenRT/os/board/rtl8720e/src/component/wifi/driver/include/hal_com_reg.h
/* REG_WL_FUNC_EN 0x0004 */
#define BIT_SHIFT_FEN_BBRSTB_V2                      17
#define BIT_FEN_BBRSTB_V2                            ((u32)0x00000001 << BIT_SHIFT_FEN_BBRSTB_V2)                      /*!<R/W 0  When this bit is set to , CCK and OFDM are disabled, and clock are gated. Otherwise, CCK and OFDM are enabled. */
#define BIT_SHIFT_FEN_BB_GLB_RSTN_V2                 16
#define BIT_FEN_BB_GLB_RSTN_V2                       ((u32)0x00000001 << BIT_SHIFT_FEN_BB_GLB_RSTN_V2)                 /*!<R/W 0  When this bit is set to , whole BB is reset. When this bit is set, BB is enabled. */
#define BIT_SHIFT_FEN_MAC_PMC                        0
#define BIT_FEN_MAC_PMC                              ((u32)0x00000001 << BIT_SHIFT_FEN_MAC_PMC)                        /*!<R/W 0  1: enable MAC PMC; 0: reset */

/* REG_CLKDIV 0x0008 */
#define BIT_SHIFT_MAC_CLK_SEL                        18
#define BIT_MASK_MAC_CLK_SEL                         ((u32)0x00000003 << BIT_SHIFT_MAC_CLK_SEL)                        /*!<R/W 2'b10  11/10:20M 01:40M 00:80M */
#define MAC_CLK_20M				(0x2 << BIT_SHIFT_MAC_CLK_SEL)
#define MAC_CLK_40M				(0x1 << BIT_SHIFT_MAC_CLK_SEL)

/* REG_WL_PMC_CTRL 0x0020 */
#define BIT_SHIFT_WL_PMC_OFFMAC                       1
#define BIT_WL_PMC_OFFMAC                             ((u32)0x00000001 << BIT_SHIFT_WL_PMC_OFFMAC)                       /*!<R/W 0  Inform WLAN PMC FSM to power On mode, include clock, isolation, power control for MAC only (clear when Power Ready) */
#define BIT_SHIFT_WL_PMC_ONMAC                       0
#define BIT_WL_PMC_ONMAC                             ((u32)0x00000001 << BIT_SHIFT_WL_PMC_ONMAC)                       /*!<R/W 0  Inform WLAN PMC FSM to power On mode, include clock, isolation, power control for MAC only (clear when Power Ready) */


//2 APS_FSMCO
#define PFM_LDALL				BIT(0)
#define PFM_ALDN				BIT(1)
#define PFM_LDKP				BIT(2)
#define PFM_WOWL				BIT(3)
#define EnPDN					BIT(4)
#define PDN_PL					BIT(5)
#define APFM_ONMAC				BIT(8)
#define APFM_OFF				BIT(9)
#define APFM_RSM				BIT(10)
#define AFSM_HSUS				BIT(11)
#define AFSM_PCIE				BIT(12)
#define APDM_MAC				BIT(13)
#define APDM_HOST				BIT(14)
#define APDM_HPDN				BIT(15)
#define RDY_MACON				BIT(16)
#define SUS_HOST				BIT(17)
#define ROP_ALD					BIT(20)
#define ROP_PWR					BIT(21)
#define ROP_SPS					BIT(22)
#define SOP_MRST				BIT(25)
#define SOP_FUSE				BIT(26)
#define SOP_ABG					BIT(27)
#define SOP_AMB					BIT(28)
#define SOP_RCK					BIT(29)
#define SOP_A8M					BIT(30)
#define XOP_BTCK				BIT(31)

//2 SYS_CLKR
#define ANAD16V_EN				BIT(0)
#define ANA8M					BIT(1)
#define MACSLP					BIT(4)
#define LOADER_CLK_EN			BIT(5)


//2 9346CR /REG_SYS_EEPROM_CTRL
#define BOOT_FROM_EEPROM		BIT(4)
#define EEPROMSEL				BIT(4)
#define EEPROM_EN				BIT(5)


//2 RF_CTRL
#define RF_EN					BIT(0)
#define RF_RSTB					BIT(1)
#define RF_SDMRSTB				BIT(2)
#define RF_DAI_REG00_WREN		BIT(6)
#define RF_DAI_RW_EN			BIT(7)


//2 LDOV12D_CTRL
#define LDV12_EN				BIT(0)
#define LDV12_SDBY				BIT(1)
#define LPLDO_HSM				BIT(2)
#define LPLDO_LSM_DIS			BIT(3)
#define _LDV12_VADJ(x)			(((x) & 0xF) << 4)



//2 EFUSE_TEST (For RTL8723 partially)
#define EF_TRPT					BIT(7)
#define EF_CELL_SEL				(BIT(8)|BIT(9)) // 00: Wifi Efuse, 01: BT Efuse0, 10: BT Efuse1, 11: BT Efuse2
#define LDOE25_EN				BIT(31)
#define EFUSE_SEL(x)				(((x) & 0x3) << 8)
#define EFUSE_SEL_MASK			0x300
#define EFUSE_WIFI_SEL_0		0x0
#define EFUSE_BT_SEL_0			0x1
#define EFUSE_BT_SEL_1			0x2
#define EFUSE_BT_SEL_2			0x3


//2 8051FWDL
//2 MCUFWDL
#define MCUFWDL_EN				BIT(0)
#define MCUFWDL_RDY			BIT(1)
#define FWDL_ChkSum_rpt		BIT(2)
#define MACINI_RDY				BIT(3)
#define BBINI_RDY				BIT(4)
#define RFINI_RDY				BIT(5)
#define WINTINI_RDY				BIT(6)
#define RAM_DL_SEL				BIT(7)
#define ROM_DLEN				BIT(19)
#define CPRST					BIT(23)


//2 REG_SYS_CFG
#define XCLK_VLD				BIT(0)
#define ACLK_VLD				BIT(1)
#define UCLK_VLD				BIT(2)
#define PCLK_VLD				BIT(3)
#define PCIRSTB					BIT(4)
#define V15_VLD					BIT(5)
#define SW_OFFLOAD_EN			BIT(7)
#define SIC_IDLE					BIT(8)
#define BD_MAC2					BIT(9)
#define BD_MAC1					BIT(10)
#define IC_MACPHY_MODE		BIT(11)
#if !defined(CONFIG_PLATFORM_8710C) //by Chris_yang, because it has conflict with platform CHIP_VER
#define CHIP_VER				(BIT(12)|BIT(13)|BIT(14)|BIT(15))
#endif
#define BT_FUNC					BIT(16)
#define VENDOR_ID				BIT(19)
#define EXT_VENDOR_ID			(BIT(18)|BIT(19)) //Currently only for RTL8723B
#define PAD_HWPD_IDN			BIT(22)
#define TRP_VAUX_EN				BIT(23)	// RTL ID
#define TRP_BT_EN				BIT(24)
#define BD_PKG_SEL				BIT(25)
#define BD_HCI_SEL				BIT(26)
#define TYPE_ID					BIT(27)
#define RF_TYPE_ID				BIT(27)

#define RTL_ID					BIT(23) // TestChip ID, 1:Test(RLE); 0:MP(RL)
#define SPS_SEL					BIT(24) // 1:LDO regulator mode; 0:Switching regulator mode


#define CHIP_VER_RTL_MASK		0xF000	//Bit 12 ~ 15
#define CHIP_VER_RTL_SHIFT		12
#define EXT_VENDOR_ID_SHIFT	18

//2 REG_GPIO_OUTSTS (For RTL8723 only)
#define EFS_HCI_SEL				(BIT(0)|BIT(1))
#define PAD_HCI_SEL				(BIT(2)|BIT(3))
#define HCI_SEL					(BIT(4)|BIT(5))
#define PKG_SEL_HCI				BIT(6)
#define FEN_GPS					BIT(7)
#define FEN_BT					BIT(8)
#define FEN_WL					BIT(9)
#define FEN_PCI					BIT(10)
#define FEN_USB					BIT(11)
#define BTRF_HWPDN_N			BIT(12)
#define WLRF_HWPDN_N			BIT(13)
#define PDN_BT_N				BIT(14)
#define PDN_GPS_N				BIT(15)
#define BT_CTL_HWPDN			BIT(16)
#define GPS_CTL_HWPDN			BIT(17)
#define PPHY_SUSB				BIT(20)
#define UPHY_SUSB				BIT(21)
#define PCI_SUSEN				BIT(22)
#define USB_SUSEN				BIT(23)
#define RF_RL_ID					(BIT(31)|BIT(30)|BIT(29)|BIT(28))

//2 REG_WL_BTCOEX_CTRL (0x74)
#define PTA_EN					BIT(16)
#define BT_MODE					(BIT(17)|BIT(18))


//-----------------------------------------------------
//
//	0x0100h ~ 0x01FFh	MACTOP General Configuration
//
//-----------------------------------------------------

//2 Function Enable Registers
//2 CR
#define HCI_TXDMA_EN			BIT(0)
#define HCI_RXDMA_EN			BIT(1)
#define TXDMA_EN				BIT(2)
#define RXDMA_EN				BIT(3)
#define PROTOCOL_EN				BIT(4)
#define SCHEDULE_EN				BIT(5)
#define MACTXEN					BIT(6)
#define MACRXEN					BIT(7)
#define ENSWBCN					BIT(8)
#define ENSEC					BIT(9)
#define CALTMR_EN				BIT(10)	// 32k CAL TMR enable

