Samsung/TizenRT/os/board/rtl8720e/src/component/wifi/driver/include/hal_com_reg.h
//2 REG_NOA_DESC_SEL (0x5CF)
#define NOA_DESC_SEL_0			0
#define NOA_DESC_SEL_1			BIT(4)

//2 REG_PTA_PRE_TRX_CTRL(0x5B8)
#define PTA_RXBCN_DIR	BIT(29)
//-----------------------------------------------------
//
//	0x0600h ~ 0x07FFh	WMAC Configuration
//
//-----------------------------------------------------

//2 APSD_CTRL
#define APSDOFF					BIT(6)

//2 TCR
#define TSFRST					BIT(0)
#define DIS_GCLK					BIT(1)
#define PAD_SEL					BIT(2)
#define PWR_ST					BIT(6)
#define PWRBIT_OW_EN			BIT(7)
#define ACRC						BIT(8)
#define CFENDFORM				BIT(9)
#define ICV						BIT(10)


//2 RCR
#define AAP						BIT(0)
#define APM						BIT(1)
#define AM						BIT(2)
#define AB						BIT(3)
#define ADD3						BIT(4)
#define APWRMGT				BIT(5)
#define CBSSID					BIT(6)
#define CBSSID_DATA				BIT(6)
#define CBSSID_BCN				BIT(7)
#define ACRC32					BIT(8)
#define AICV						BIT(9)
#define ADF						BIT(11)
#define ACF						BIT(12)
#define AMF						BIT(13)
#define HTC_LOC_CTRL			BIT(14)
#define UC_DATA_EN				BIT(16)
#define BM_DATA_EN				BIT(17)
#define MFBEN					BIT(22)
#define LSIGEN					BIT(23)
#define EnMBID					BIT(24)
#define FORCEACK				BIT(26)
#define APP_BASSN				BIT(27)
#define APP_PHYSTS				BIT(28)
#define APP_ICV					BIT(29)
#define APP_MIC					BIT(30)
#define APP_FCS					BIT(31)


//2 SECCFG
#define SCR_TxUseDK				BIT(0)			//Force Tx Use Default Key
#define SCR_RxUseDK				BIT(1)			//Force Rx Use Default Key
#define SCR_TxEncEnable			BIT(2)			//Enable Tx Encryption
#define SCR_RxDecEnable			BIT(3)			//Enable Rx Decryption
#define SCR_SKByA2				BIT(4)			//Search kEY BY A2
#define SCR_NoSKMC				BIT(5)			//No Key Search Multicast
#define SCR_TXBCUSEDK			BIT(6)			// Force Tx Broadcast packets Use Default Key
#define SCR_RXBCUSEDK			BIT(7)			// Force Rx Broadcast packets Use Default Key
#define BIT_DIS_GCLK_TKIP                          ((u32)0x00000001 << 13)          /*!<R/W 0  Disable gated clock control for WEP/TKIP engine. */

//2 REG_BBPSF_CTRL
#define BIT_BBPSF_MPDUCHKEN	BIT[5]	//{This bit is set to 1 to enable MAC to inform BB enter power saving mode as rx unmatch my MACID unicast or unmatch my BSSID Broadcast/Mutlicast packets, for non_ampdu case. Only valid when BIT_BBPSF_MHCHKEN is set 1.}						
#define BIT_BBPSF_MHCHKEN		BIT[4]	//{This bit is set to 1 to enable MAC to inform BB enter power saving mode as rx unmatch my MACID unicast or unmatch my BSSID Broadcast/Mutlicast packets}						
#define BIT_BBPSF_ERRCHKEN		BIT[3]	//{This bit is set to 1 to enable MAC to inform BB enter power saving mode as rx FCS error packets number is large than the FCS error packet threshold defined by BBPSF_ERRTHR.}						
#define BIT_MASK_BBPSF_ERRTHR	0x07	//{FCS error packet threshold: 3'd0: 1 packets; 3'd1: 2 packets; 3'd2: 4 packets; 3'd3: 6 packets¡­¡­}						
#define BIT_SHIFT_BBPSF_ERRTHR	0

//2 REG_BT_COEX (0x764)
#define SW_CTRL_BT_BASEBAND_EN				BIT(9)
#define SW_CTRL_BT_BASEBAND					BIT(10)
#define SW_CTRL_BT_RF_EN					BIT(11)
#define SW_CTRL_BT_RF						BIT(12)
//-----------------------------------------------------
//
//  0x0300h ~ 0x03FFh   PCIe/LBus
//
//-----------------------------------------------------


//4 REG_LX_CTRL1(0x300)
#define BIT_WT_LIT_EDN              	BIT(25)
#define BIT_RD_LITT_EDN             	BIT(24)

#define BIT_SHIFT_MAX_RXDMA	20
#define BIT_MASK_MAX_RXDMA     0x7
#define BIT_MAX_RXDMA(x)            (((x) & BIT_MASK_MAX_RXDMA)<<BIT_SHIFT_MAX_RXDMA)

#define BIT_SHIFT_MAX_TXDMA     16
#define BIT_MASK_MAX_TXDMA      0x7
#define BIT_MAX_TXDMA(x)            (((x) & BIT_MASK_MAX_TXDMA)<<BIT_SHIFT_MAX_TXDMA)

#define SW_BCN_ADDR_SEL		BIT(16)
#define BIT_STOP_BCNQ               	BIT(14)
#define BIT_STOP_MGQ			BIT(13)
#define BIT_STOP_VOQ                	BIT(12)
#define BIT_STOP_VIQ                	BIT(11)
#define BIT_STOP_BEQ                	BIT(10)
#define BIT_STOP_BKQ                	BIT(9)
#define BIT_STOP_RXQ                	BIT(8)
#define BIT_STOP_HI7Q               	BIT(7)
#define BIT_STOP_HI6Q               	BIT(6)
#define BIT_STOP_HI5Q               	BIT(5)
#define BIT_STOP_HI4Q               	BIT(4)
#define BIT_STOP_HI3Q               	BIT(3)
#define BIT_STOP_HI2Q               	BIT(2)
#define BIT_STOP_HI1Q               	BIT(1)
#define BIT_STOP_HI0Q               	BIT(0)


//4 REG_INT_MIG_CFG(0x0304), 4 Bytes
#define BIT_SHIFT_TXTTIMER_MATCH_NUM		28
#define BIT_MASK_TXTTIMER_MATCH_NUM			0xF
#define BIT_MAX_TXTTIMER_MATCH_NUM(x)		(((x) & BIT_MASK_TXTTIMER_MATCH_NUM)<<BIT_SHIFT_TXTTIMER_MATCH_NUM)

#define BIT_SHIFT_TXPKT_NUM_MATCH			24
#define BIT_MASK_TXPKT_NUM_MATCH                    0xF
#define BIT_MAX_TXPKT_NUM_MATCH(x)                  (((x) & BIT_MASK_TXPKT_NUM_MATCH)<<BIT_SHIFT_TXPKT_NUM_MATCH)

#define BIT_SHIFT_RXTTIMER_MATCH_NUM		20
#define BIT_MASK_RXTTIMER_MATCH_NUM			0xF
#define BIT_MAX_RXTTIMER_MATCH_NUM(x)		(((x) & BIT_MASK_RXTTIMER_MATCH_NUM)<<BIT_SHIFT_RXTTIMER_MATCH_NUM)

#define BIT_SHIFT_RXPKT_NUM_MATCH			16
#define BIT_MASK_RXPKT_NUM_MATCH			0xF
#define BIT_MAX_RXPKT_NUM_MATCH(x)			(((x) & BIT_MASK_RXPKT_NUM_MATCH)<<BIT_SHIFT_RXPKT_NUM_MATCH)

#define BIT_SHIFT_MIGRATE_TIMER				0
#define BIT_MASK_MIGRATE_TIMER				0xFFFF
#define BIT_MAX_MIGRATE_TIMER(x)				(((x) & BIT_MASK_MIGRATE_TIMER)<<BIT_SHIFT_MIGRATE_TIMER)

//4 #define REG_BCNQ_TXBD_DESA          0x0308  // 8 Bytes
//4 #define REG_MGQ_TXBD_DESA           0x0310  // 8 Bytes
//4 #define REG_VOQ_TXBD_DESA           0x0318  // 8 Bytes
//4 #define REG_VIQ_TXBD_DESA           0x0320  // 8 Bytes
//4 #define REG_BEQ_TXBD_DESA           0x0328  // 8 Bytes
//4 #define REG_BKQ_TXBD_DESA           0x0330  // 8 Bytes
//4 #define REG_RXQ_RXBD_DESA           0x0338  // 8 Bytes
//4 #define REG_HI0Q_TXBD_DESA          0x0340  // 8 Bytes
//4 #define REG_HI1Q_TXBD_DESA          0x0348  // 8 Bytes
//4 #define REG_HI2Q_TXBD_DESA          0x0350  // 8 Bytes
//4 #define REG_HI3Q_TXBD_DESA          0x0358  // 8 Bytes
//4 #define REG_HI4Q_TXBD_DESA          0x0360  // 8 Bytes
//4 #define REG_HI5Q_TXBD_DESA          0x0368  // 8 Bytes
//4 #define REG_HI6Q_TXBD_DESA          0x0370  // 8 Bytes
//4 #define REG_HI7Q_TXBD_DESA          0x0378  // 8 Bytes


