Samsung/TizenRT/os/board/rtl8720e/src/component/wifi/driver/include/hal_com_reg.h
//4 #define REG_PCIE_MIX_CFG            0x03F8  // 4 Bytes
//4 #define REG_BUS_MIX_CFG             0x03F8  // 4 Bytes
#define BIT_SHIFT_WATCH_DOG_RECORD              10
#define BIT_MASK_WATCH_DOG_RECORD               0x3FFF
#define BIT_WATCH_DOG_RECORD(x)                 (((x) & BIT_MASK_WATCH_DOG_RECORD)<<BIT_SHIFT_WATCH_DOG_RECORD)

#define BIT_R_IO_TIMEOUT_FLAG                   BIT(9)
#define BIT_EN_WATCH_DOG                        BIT(8)



#define REG_BUS_MIX_CFG             0x03F8  // 4 Bytes

//-----------------------------------------------------
//
//  0x0700h ~ 0x07FFh
//
//-----------------------------------------------------
//2 REG_BT_STAT_CTRL (0x0778)
#define BIT_RTK_MODE_EN			BIT(0)

//2 REG_BT_COEX_ENHANCED_INTR_CTRL (0x076E)
#define BIT_WL_ACT_MASK_EN		BIT(1)
#define BIT_WL_ACT_PINMUX		BIT(3)


//2 REG_BT_TDMA_TIME (0x0790)
#define BIT_BT_REPORT_SAMPLE_RATE 		(BIT(5)|BIT(4)|BIT(3)|BIT(2)|BIT(1)|BIT(0))



//-----------------------------------------------------
//
//	0xFE00h ~ 0xFE55h	USB Configuration
//
//-----------------------------------------------------

//2 USB Information (0xFE17)
#define USB_IS_HIGH_SPEED			0
#define USB_IS_FULL_SPEED			1
#define USB_SPEED_MASK				BIT(5)

#define USB_NORMAL_SIE_EP_MASK	0xF
#define USB_NORMAL_SIE_EP_SHIFT	4

//2 Special Option
#define USB_AGG_EN				BIT(3)

// 0; Use interrupt endpoint to upload interrupt pkt
// 1; Use bulk endpoint to upload interrupt pkt,
#define INT_BULK_SEL			BIT(4)

//2REG_C2HEVT_CLEAR
#define C2H_EVT_HOST_CLOSE		0x00	// Set by driver and notify FW that the driver has read the C2H command message
#define C2H_EVT_FW_CLOSE		0xFF	// Set by FW indicating that FW had set the C2H command message and it's not yet read by driver.


//2REG_MULTI_FUNC_CTRL(For RTL8723 Only)
#define WL_HWPDN_EN			BIT0	// Enable GPIO[9] as WiFi HW PDn source
#define WL_HWPDN_SL			BIT1	// WiFi HW PDn polarity control
#define WL_FUNC_EN				BIT2	// WiFi function enable
#define WL_HWROF_EN			BIT3	// Enable GPIO[9] as WiFi RF HW PDn source
#define BT_HWPDN_EN			BIT16	// Enable GPIO[11] as BT HW PDn source
#define BT_HWPDN_SL			BIT17	// BT HW PDn polarity control
#define BT_FUNC_EN				BIT18	// BT function enable
#define BT_HWROF_EN			BIT19	// Enable GPIO[11] as BT/GPS RF HW PDn source
#define GPS_HWPDN_EN			BIT20	// Enable GPIO[10] as GPS HW PDn source
#define GPS_HWPDN_SL			BIT21	// GPS HW PDn polarity control
#define GPS_FUNC_EN			BIT22	// GPS function enable

//3 REG_LIFECTRL_CTRL
#define HAL92C_EN_PKT_LIFE_TIME_BK		BIT3
#define HAL92C_EN_PKT_LIFE_TIME_BE		BIT2
#define HAL92C_EN_PKT_LIFE_TIME_VI		BIT1
#define HAL92C_EN_PKT_LIFE_TIME_VO		BIT0

#define HAL92C_MSDU_LIFE_TIME_UNIT		128	// in us, said by Tim.

//2 8192D PartNo.
#define PARTNO_92D_NIC							(BIT7|BIT6)
#define PARTNO_92D_NIC_REMARK 				(BIT5|BIT4)
#define PARTNO_SINGLE_BAND_VS  				BIT3
#define PARTNO_SINGLE_BAND_VS_REMARK 		BIT1
#define PARTNO_CONCURRENT_BAND_VC 			(BIT3|BIT2)
#define PARTNO_CONCURRENT_BAND_VC_REMARK 	(BIT1|BIT0)

//========================================================
// General definitions
//========================================================

#define LAST_ENTRY_OF_TX_PKT_BUFFER_8188E		176
#define LAST_ENTRY_OF_TX_PKT_BUFFER_8812			255
#define LAST_ENTRY_OF_TX_PKT_BUFFER_8723B		255
#define LAST_ENTRY_OF_TX_PKT_BUFFER_8192C		255
#define LAST_ENTRY_OF_TX_PKT_BUFFER_DUAL_MAC	127
#define LAST_ENTRY_OF_TX_PKT_BUFFER_8188F			255
#define LAST_ENTRY_OF_TX_PKT_BUFFER_8723D		255

#define POLLING_LLT_THRESHOLD				20
#define POLLING_READY_TIMEOUT_COUNT		1000

// GPIO BIT
#define HAL_8192C_HW_GPIO_WPS_BIT	BIT2

#endif //__HAL_COMMON_H__

